{
  "apiKey": "AIzaSyA_SK0seFIWdDosdbgsvQR0mSVcAr903i8",
  "country": "brooklyn",
  "categories": [
    {
      "foodType": "rice",
      "items": [
        {
          "fullName": "Yellow Rice: Seasoned rice cooked with turmeric, onions, and spices, vibrant and aromatic.",
          "shortName": "yellow-rice"
        },
        {
          "fullName": "Rice and Gravy: Steamed white rice served with rich brown gravy, comforting and savory.",
          "shortName": "rice-gravy"
        }
      ],
      "promptTemplate": "A strictly top-down, photorealistic view (shot from directly above) showing 1/4 of a portion of {{fullName}} scooped and dropped naturally onto a surface, creating an irregular, organic pile with uneven edges. The food should spread asymmetrically with some pieces extending beyond the main mound, looking casually served rather than perfectly arranged. Natural texture variations and slight spillage. The food item must be perfectly centered both vertically and horizontally in the frame, positioned at the exact center of the image. The food item itself may have minimal internal shadows for depth and realism, but the background must be completely pure white extending to all edges and sides of the image. No shadows cast on the background, no plate, no objects. The entire image background from edge to edge must be solid white with no gradients, no shadows, no variations. White sides, white edges, pure white background throughout. Strictly no text, no letters, no words, no labels, no writing of any kind should appear anywhere in the image."
    },
    {
      "foodType": "protein-vegetable",
      "items": [
        {
          "fullName": "Soul Food Fried Chicken: Crispy golden fried chicken, double-dipped in seasoned flour, juicy and perfectly seasoned.",
          "shortName": "soul-fried-chicken"
        },
        {
          "fullName": "Smothered Pork Chops: Tender pork chops slow-cooked in a rich onion gravy until fork-tender.",
          "shortName": "smothered-pork-chops"
        },
        {
          "fullName": "Oxtails: Braised oxtails in a rich brown gravy with vegetables, fall-off-the-bone tender.",
          "shortName": "oxtails"
        },
        {
          "fullName": "Candied Yams: Sweet potatoes glazed with brown sugar, butter, and spices, caramelized and tender.",
          "shortName": "candied-yams"
        },
        {
          "fullName": "Fried Whiting: Lightly breaded and fried whiting fish, crispy and golden, a Brooklyn favorite.",
          "shortName": "fried-whiting"
        }
      ],
      "promptTemplate": "A strictly top-down, photorealistic view (shot from directly above) showing 1/4 of a portion of {{fullName}} arranged in a pile. Minimalist, with seasoning but no toppings. The food item must be perfectly centered both vertically and horizontally in the frame, positioned at the exact center of the image. The food item itself may have minimal internal shadows for depth and realism, but the background must be completely pure white extending to all edges and sides of the image. No shadows cast on the background, no plate, no objects. The entire image background from edge to edge must be solid white with no gradients, no shadows, no variations. White sides, white edges, pure white background throughout. Strictly no text, no letters, no words, no labels, no writing of any kind should appear anywhere in the image."
    },
    {
      "foodType": "beans",
      "items": [
        {
          "fullName": "Black Beans and Rice: Seasoned black beans cooked with onions, garlic, and spices, served over rice.",
          "shortName": "black-beans-rice"
        },
        {
          "fullName": "Red Beans: Slow-simmered red kidney beans with smoked meat, bell peppers, and Creole seasonings.",
          "shortName": "red-beans"
        }
      ],
      "promptTemplate": "A strictly top-down, photorealistic view (shot from directly above) showing 1/4 of a portion of {{fullName}} naturally scattered and piled on a surface. The beans should be visible individually, some clustered together, some spread out, creating an organic, casual arrangement. Some beans may have a light coating of sauce or oil, showing natural variations in texture and sheen. The pile should have irregular edges with beans extending beyond the main cluster. The food item must be perfectly centered both vertically and horizontally in the frame, positioned at the exact center of the image. The food item itself may have minimal internal shadows for depth and realism, but the background must be completely pure white extending to all edges and sides of the image. No shadows cast on the background, no plate, no objects. The entire image background from edge to edge must be solid white with no gradients, no shadows, no variations. White sides, white edges, pure white background throughout. Strictly no text, no letters, no words, no labels, no writing of any kind should appear anywhere in the image."
    },
    {
      "foodType": "toppings",
      "items": [
        {
          "fullName": "Hot Sauce: Spicy vinegar-based hot sauce with cayenne peppers, tangy and fiery.",
          "shortName": "hot-sauce"
        },
        {
          "fullName": "BBQ Sauce: Sweet and smoky barbecue sauce with molasses and spices, rich and tangy.",
          "shortName": "bbq-sauce"
        },
        {
          "fullName": "Tartar Sauce: Creamy tartar sauce with pickles and herbs, tangy and smooth.",
          "shortName": "tartar-sauce"
        },
        {
          "fullName": "Honey Hot Sauce: Sweet and spicy honey hot sauce, combining heat with sweetness.",
          "shortName": "honey-hot-sauce"
        }
      ],
      "promptTemplate": "A strictly top-down, photorealistic view (shot from directly above) showing 1/4 of a portion of {{fullName}} served in a small white condiment cup. The condiment cup should be a small circular container with visible edges. The topping inside the cup must fill the entire circular opening, forming a perfect full circle with no gaps or missing edges. The food should completely fill the cup's circular opening from edge to edge. If it's a sauce or pesto, show it as a circular mound filling the cup. If it's grated cheese, show it piled in a circular shape filling the cup. If it's vegetables or diced items, arrange them to form a complete circular arrangement that fills the entire cup opening. The circle must be full and complete, with all edges clearly defined and touching the cup's inner rim. The condiment cup and food item must be perfectly centered both vertically and horizontally in the frame, positioned at the exact center of the image. The food item and cup itself may have minimal internal shadows for depth and realism, but the background must be completely pure white extending to all edges and sides of the image. No shadows cast on the background, no objects. The entire image background from edge to edge must be solid white with no gradients, no shadows, no variations. White sides, white edges, pure white background throughout. Strictly no text, no letters, no words, no labels, no writing of any kind should appear anywhere in the image."
    }
  ]
}

