{
  "apiKey": "AIzaSyA_SK0seFIWdDosdbgsvQR0mSVcAr903i8",
  "country": "jamaican",
  "categories": [
    {
      "foodType": "rice",
      "items": [
        {
          "fullName": "Jasmine Rice (Rice and Peas): Fragrant jasmine rice cooked with coconut milk, kidney beans, thyme, and allspice, a Jamaican staple.",
          "shortName": "jasmine-rice"
        },
        {
          "fullName": "Coconut Rice: Creamy rice cooked with coconut milk, ginger, and scallions, rich and aromatic.",
          "shortName": "coconut-rice"
        }
      ],
      "promptTemplate": "A strictly top-down, photorealistic view (shot from directly above) showing 1/4 of a portion of {{fullName}} scooped and dropped naturally onto a surface, creating an irregular, organic pile with uneven edges. The food should spread asymmetrically with some pieces extending beyond the main mound, looking casually served rather than perfectly arranged. Natural texture variations and slight spillage. The food item must be perfectly centered both vertically and horizontally in the frame, positioned at the exact center of the image. The food item itself may have minimal internal shadows for depth and realism, but the background must be completely pure white extending to all edges and sides of the image. No shadows cast on the background, no plate, no objects. The entire image background from edge to edge must be solid white with no gradients, no shadows, no variations. White sides, white edges, pure white background throughout. Strictly no text, no letters, no words, no labels, no writing of any kind should appear anywhere in the image."
    },
    {
      "foodType": "protein-vegetable",
      "items": [
        {
          "fullName": "Jerk Chicken: Marinated chicken grilled with a spicy jerk seasoning blend of scotch bonnet peppers, allspice, thyme, and garlic.",
          "shortName": "jerk-chicken"
        },
        {
          "fullName": "Curry Goat: Tender goat meat slow-cooked in a rich curry sauce with Jamaican curry powder, turmeric, and thyme.",
          "shortName": "curry-goat"
        },
        {
          "fullName": "Brown Stew Chicken: Chicken braised in a savory brown gravy with caramelized onions, carrots, and Jamaican spices.",
          "shortName": "brown-stew-chicken"
        },
        {
          "fullName": "Oxtail: Slow-braised oxtail in a rich brown gravy with butter beans, thyme, and scotch bonnet pepper, tender and flavorful.",
          "shortName": "oxtail"
        },
        {
          "fullName": "Ackee and Saltfish: Jamaica's national dish - scrambled ackee fruit with salted codfish, onions, peppers, and tomatoes.",
          "shortName": "ackee-saltfish"
        }
      ],
      "promptTemplate": "A strictly top-down, photorealistic view (shot from directly above) showing 1/4 of a portion of {{fullName}} arranged in a pile. Minimalist, with seasoning but no toppings. The food item must be perfectly centered both vertically and horizontally in the frame, positioned at the exact center of the image. The food item itself may have minimal internal shadows for depth and realism, but the background must be completely pure white extending to all edges and sides of the image. No shadows cast on the background, no plate, no objects. The entire image background from edge to edge must be solid white with no gradients, no shadows, no variations. White sides, white edges, pure white background throughout. Strictly no text, no letters, no words, no labels, no writing of any kind should appear anywhere in the image."
    },
    {
      "foodType": "beans",
      "items": [
        {
          "fullName": "Red Kidney Beans (Rice and Peas Beans): Large red kidney beans simmered with coconut milk, thyme, scallions, and allspice, tender and creamy.",
          "shortName": "red-kidney-beans"
        },
        {
          "fullName": "Black Beans: Slow-cooked black beans with garlic, thyme, and scotch bonnet pepper, smoky and aromatic.",
          "shortName": "black-beans"
        }
      ],
      "promptTemplate": "A strictly top-down, photorealistic view (shot from directly above) showing 1/4 of a portion of {{fullName}} naturally scattered and piled on a surface. The beans should be visible individually, some clustered together, some spread out, creating an organic, casual arrangement. Some beans may have a light coating of sauce or oil, showing natural variations in texture and sheen. The pile should have irregular edges with beans extending beyond the main cluster. The food item must be perfectly centered both vertically and horizontally in the frame, positioned at the exact center of the image. The food item itself may have minimal internal shadows for depth and realism, but the background must be completely pure white extending to all edges and sides of the image. No shadows cast on the background, no plate, no objects. The entire image background from edge to edge must be solid white with no gradients, no shadows, no variations. White sides, white edges, pure white background throughout. Strictly no text, no letters, no words, no labels, no writing of any kind should appear anywhere in the image."
    },
    {
      "foodType": "toppings",
      "items": [
        {
          "fullName": "Scotch Bonnet Pepper Sauce: Fiery hot sauce made from scotch bonnet peppers, vinegar, and spices, adding heat and flavor.",
          "shortName": "scotch-bonnet-sauce"
        },
        {
          "fullName": "Fried Plantains: Sweet fried plantains, caramelized and golden, a popular Jamaican side.",
          "shortName": "fried-plantains"
        },
        {
          "fullName": "Pickled Cabbage: Tangy pickled cabbage with carrots and vinegar, adding crunch and acidity.",
          "shortName": "pickled-cabbage"
        },
        {
          "fullName": "Jerk Sauce: Spicy and smoky jerk marinade sauce with allspice, thyme, and scotch bonnet peppers.",
          "shortName": "jerk-sauce"
        }
      ],
      "promptTemplate": "A strictly top-down, photorealistic view (shot from directly above) showing 1/4 of a portion of {{fullName}} served in a small white condiment cup. The condiment cup should be a small circular container with visible edges. The topping inside the cup must fill the entire circular opening, forming a perfect full circle with no gaps or missing edges. The food should completely fill the cup's circular opening from edge to edge. If it's a sauce or pesto, show it as a circular mound filling the cup. If it's grated cheese, show it piled in a circular shape filling the cup. If it's vegetables or diced items, arrange them to form a complete circular arrangement that fills the entire cup opening. The circle must be full and complete, with all edges clearly defined and touching the cup's inner rim. The condiment cup and food item must be perfectly centered both vertically and horizontally in the frame, positioned at the exact center of the image. The food item and cup itself may have minimal internal shadows for depth and realism, but the background must be completely pure white extending to all edges and sides of the image. No shadows cast on the background, no objects. The entire image background from edge to edge must be solid white with no gradients, no shadows, no variations. White sides, white edges, pure white background throughout. Strictly no text, no letters, no words, no labels, no writing of any kind should appear anywhere in the image."
    }
  ]
}

